---
kind: other
id: Methods.T:Autodesk.Revit.DB.TriangulatedShellComponent
source: html/9db915bf-97c9-c257-aff4-cc602a6b1078.htm
---
# TriangulatedShellComponent Methods

Empties the contents of this TriangulatedShellComponent.